R.STR['ja'].A_YES = `はい`;
R.STR['ja'].A_NO = `いいえ`;
R.STR['ja'].A_EDGE = `イキそう`;
R.STR['ja'].A_RESUME = `つづく`;
R.STR['ja'].A_CUM = `イく`;
R.STR['ja'].A_START = `GO`;
R.STR['ja'].A_FASTER = `速く`;
R.STR['ja'].A_SLOWER = `遅く`;

/* single line */
R.STR['ja'].L_LEN_ADD = `（正義のヒーローズの洗脳効果が一日伸びた）`;
R.STR['ja'].L_LEN_SUB = `（正義のヒーローズの洗脳効果が一日短縮した）`;

R.STR['ja'].L_MORE = `（もう一回りするか…？）`;

R.STR['ja'].L_G_RUSH_KEEP = `寸止めまでシコシコし続けて`;
R.STR['ja'].L_G_RUSH_COUNT = `寸止め一回`;
R.STR['ja'].L_G_RUSH_NOGO = `早いすぎます！`;

R.STR['ja'].L_G_RUSH_RESULT = `寸止計%1回でした`;

R.STR['ja'].L_G_MEM_BEGIN = `しごくか休むか自由にどうぞ`;
R.STR['ja'].L_G_MEM_GOOD = `正解！`;
R.STR['ja'].L_G_MEM_BAD = `不正解！`;

R.STR['ja'].L_G_MEM_RESULT = `不正解%1回！`;

R.STR['ja'].L_G_SPEED_INFO = `%1秒後寸止めするんや`;
R.STR['ja'].L_G_SPEED_ERR = `%1秒の誤差やな`;

R.STR['ja'].L_G_BP_GOOD = `休憩で～す。+1点`;
R.STR['ja'].L_G_BP_BAD = `休憩で～す。-1点`;

R.STR['ja'].L_G_BP_RESULT = `全部%1点！`;

/* random single line */
R.STR['ja'].LL_EDGE = [
	`プロデューサーさん、遊んで…`,
	`気持ちいい？`,
	`プロデューサーさんのココ、よしよしっと`,
	`一緒にきもちよくなろう`,
];

R.STR['ja'].LL_REST = [
	`（アイドルを振りほどいた。一息をつく）`,
	`（アイドルは一旦避けた。休む）`,
];
R.STR['ja'].LL_HOLD = [
	`（アイドルを振りほどけない、我慢するんだ）`,
	`（アイドルが絡んでる、耐えるんだ）`,
];

R.STR['ja'].LL_COMEBACK = [
	`（アイドルたちに囲まれた！）`,
];
R.STR['ja'].LL_FIRST = [
	`わー、プロデューサーさんです！`,
	`へへ、つかまえたー`,
	`プロデューサーさん、こっちさびしいよ`,
];
R.STR['ja'].LL_FIRST_END = [
	`（やっとアイドルたちから逃げきった）`,
];
R.STR['ja'].LL_BET = [
	`（正義のヒーローズだ！生命パワーを献上するか）`,
	`（正義のヒーローズだ！洗脳から解放したのか）`,
];
R.STR['ja'].LL_BET_YES = [
	`（今だ！）`,
	`（いくしかない！）`,
];
R.STR['ja'].LL_BET_NO = [
	`（やめよう。まだ覚醒してないみたい）`,
	`（やめよう。劇場の魂の罠かも）`,
];
R.STR['ja'].LL_GAME_GOOD = [
	`わあ、すごいです！`,
	`プロデューサーさん強い！`,
	`さすがプロデューサーさん！`,
];

R.STR['ja'].LL_GAME_NOTBAD = [
	`まあまあ`,
	`どうだろ…`,
	`いつもと同じね`,
];

R.STR['ja'].LL_GAME_BAD = [
	`よわ～い、アハッ`,
	`だめになっちゃったよ`,
	`プロデューサーさんよわくなった？`,
];

/* Multiple lines */
R.STR['ja'].SP_WELCOME = `
プロデューサーさん、大変です！
アイドルたちがまた劇場の魂に取り憑かれて、プロデューサーさんに襲い掛かってきてるんです！
プロデューサーさんの体に秘めた「生命の力」を、アイドルの体で奪って世界征服の陰謀に使うつもりです！
う…！私ももはや自分をコントロールできません…
プロデューサーさん、その「生命の力」を絶対に渡さないでください！
それと同時にアイドルたちが完全に闇に飲まれないように、彼女たちの要求をできるだけ満たしてください！
そして正義のヒーローズの洗脳が解けたら、「生命の力」を彼女たちに渡して、こうやってしか劇場の魂を倒さないのです！
プロデューサーさん、がんばってください！`;

R.STR['ja'].SP_COMEBACK = `プロデューサーさん、今日もがんばってください！`;

R.STR['ja'].SP_OLD_DAY = `
プロデューサーさん、今日はもう終わりです！
明日に備えて、英気を養ってください！
「生命の力」が出そうで出ない練習をもう%1回やってください！`;

R.STR['ja'].SP_SKIP_DAY = `
プロデューサーさん！
あなたが%1日不在だったため
劇場の魂の正義のヒーローズへの洗脳がまたその日数分伸びてしまったのです！`;

R.STR['ja'].SP_CUM_OK = `
あぁ…プロデューサーさん…
「生命の力」を…ください…！`;

R.STR['ja'].SP_CUM_NOGO = `
（しまった！）
（正義のヒーローズの洗脳はまだ解けていない！）
（俺の接触により、逆に洗脳が深まった…）`;

R.STR['ja'].SP_FINISH = `
あっ！プロデューサーさん！♡
…はっ♡…大好き…
（こうやって、生命の力を手に入れたヒーローズが劇場の魂を倒した）
（世界の平和が守られた、めでたしめでたし）
（おわり）
（こんなバカゲーを遊んでくれてありがとうございました）`;

R.STR['ja'].SP_G_RUSH = `
（ゆ○こに捕まった！）
うわ、なんでプロデューサーさんがこんなどころに
プ…プロデューサーに…
寸止め一杯してほしいです…！`;

R.STR['ja'].SP_G_MEM = `
（め○みに捕まった！）
にゃはは、プロデューサー幸せ者だな
じゃあ、どこまでアタシたちを大事にしたのかテスト～
二回以上に出た子だけに寸止めして！`;

R.STR['ja'].SP_G_SPEED = `
（な○に捕まった！）
プロデューサーさん、男は時間を守るのか大事なんや！
やから、リズムに乗って、
ちょっと指定の時間に寸止めするんで！`;

R.STR['ja'].SP_G_BP = `
（つ○さに捕まった！）
もう～プロデューサーさんのえっち！
今から
パンパンしてない女の子だけには
寸止めを許可しますよー`;

R.STR['ja'].SP_DAY = `
プロデューサーさんお疲れ様！
今日も劇場のみんなを守ったんですね！
明日のためによくやすんでください！
「生命の力」は絶対に出さないでくださいね！
それに、「生命の力」が出そうで出ない練習を%1回やってください！
劇場のみんなが待ってますから！`;