R.STR['zh'].A_YES = `是`;
R.STR['zh'].A_NO = `否`;
R.STR['zh'].A_EDGE = `要射了`;
R.STR['zh'].A_RESUME = `继续`;
R.STR['zh'].A_CUM = `射了`;
R.STR['zh'].A_START = `开始`;
R.STR['zh'].A_FASTER = `快点`;
R.STR['zh'].A_SLOWER = `慢点`;

/* single line */
R.STR['zh'].L_LEN_ADD = `（正义的伙伴们摆脱控制延迟1天。）`;
R.STR['zh'].L_LEN_SUB = `（正义的伙伴们摆脱控制提前1天。）`;

R.STR['zh'].L_MORE = `继续在765剧场里巡逻吗？`;

R.STR['zh'].L_G_RUSH_KEEP = `一直撸动，寸止前请不要停下来！`;
R.STR['zh'].L_G_RUSH_COUNT = `寸止一次。`;
R.STR['zh'].L_G_RUSH_NOGO = `太快了，不算数！`;

R.STR['zh'].L_G_RUSH_RESULT = `总共寸止了%1次。`;

R.STR['zh'].L_G_MEM_BEGIN = `可以自由选择撸或停哦`;
R.STR['zh'].L_G_MEM_GOOD = `正确！`;
R.STR['zh'].L_G_MEM_BAD = `错误！`;

R.STR['zh'].L_G_MEM_RESULT = `总共犯了%1次错误。`;

R.STR['zh'].L_G_SPEED_INFO = `%1秒后寸止。`;
R.STR['zh'].L_G_SPEED_ERR = `误差是%1秒。`;

R.STR['zh'].L_G_BP_GOOD = `休息。+1分`;
R.STR['zh'].L_G_BP_BAD = `休息。-1分`;

R.STR['zh'].L_G_BP_RESULT = `总得分是%1。`;

/* random single line */
R.STR['zh'].LL_EDGE = [
	`制作人先生陪我玩`,
	`舒服吗？`,
	`哇，制作人先生变大了`,
	`我们一起做舒服的事吧`,
];

R.STR['zh'].LL_REST = [
	`（挣脱了偶像，休息一下）`,
	`（摆脱了纠缠，冷静下来）`,
];
R.STR['zh'].LL_HOLD = [
	`（挣扎不脱，坚持住！）`,
	`（挣扎不脱，不能交出能量！）`,
	`（被缠住了，能量不能泄！）`,
];

R.STR['zh'].LL_COMEBACK = [
	`（偶像们包围了过来！）`,
];
R.STR['zh'].LL_FIRST = [
	`哇，是制作人先生！`,
	`嘿嘿，制作人先生抓住你了`,
	`制作人先生好想你~`,
];
R.STR['zh'].LL_FIRST_END = [
	`（总算摆脱了这一群偶像）`,
	`（总算逃掉了）`,
];
R.STR['zh'].LL_BET = [
	`（是正义的伙伴！要交出能量吗？）`,
	`（是正义的伙伴！她们觉醒了吗？）`,
];
R.STR['zh'].LL_BET_YES = [
	`（就是现在！）`,
	`（只能出击了！）`,
];
R.STR['zh'].LL_BET_NO = [
	`（算了，她们可能还没有觉醒）`,
	`（算了，可能是剧场之魂的陷阱）`,
];
R.STR['zh'].LL_GAME_GOOD = [
	`哇，好厉害！`,
	`制作人先生好坚挺！`,
	`不愧是制作人先生！`,
];

R.STR['zh'].LL_GAME_NOTBAD = [
	`还可以嘛`,
	`嗯……`,
	`和平常一样`,
];

R.STR['zh'].LL_GAME_BAD = [
	`好弱啊，啊哈`,
	`成绩下降了~`,
	`制作人先生耐力变弱了~`,
];

/* Multiple lines */
R.STR['zh'].SP_WELCOME = `
制作人先生，不好了！
剧场之魂又占据了偶像们的心灵，开始袭击制作人先生了！
制作人先生的身体埋藏着能统治世界的能量，剧场之魂想借偶像们的手夺走它！
呜，连我也要控制不住我自己了……
制作人先生，请千万不要交出你的“能量”！
同时尽量满足偶像们的需求，以免她们完全被邪恶吞噬……
当正义的伙伴们觉醒后，请把“能量”交给她们，才能最终打败剧场之魂！
制作人先生，请加油！`;

R.STR['zh'].SP_COMEBACK = `制作人先生，今天也请加油！`;

R.STR['zh'].SP_OLD_DAY = `
制作人先生！
今天已经结束了，请好好养精蓄锐
请再多做%1次快要泄出能量，最后控制住的练习！`;

R.STR['zh'].SP_SKIP_DAY = `
制作人先生！
你%1天没有来剧场帮助偶像们
剧场之魂的控制又加深了！`;

R.STR['zh'].SP_CUM_OK = `
啊……制作人先生……
请把能量注入我的身体……`;

R.STR['zh'].SP_CUM_NOGO = `
上当了！
正义的伙伴们尚末觉醒！
剧场之魂对她们的洗脑加深了！`;

R.STR['zh'].SP_FINISH = `
啊！制作人先生！
……哈……制作人先生……喜欢……
（就这样，得到了能量的正义的伙伴打败了剧场之魂）
（世界的和平被守护了，可喜可贺）
（完）
（感谢游玩这个逗比小游戏）`;

R.STR['zh'].SP_G_RUSH = `
（被七○百合子抓住了！）
哇，制作人先生怎么躲在这里
我……我想要制作人先生……
寸止尽可能多的次数……！`;

R.STR['zh'].SP_G_MEM = `
（被○惠美抓住了！）
Nyahaha，制作人好幸福啊
要用真心对待我们哟
对所有出现过两次和以上的偶像寸止！`;

R.STR['zh'].SP_G_SPEED = `
（被横○奈绪抓住了！）
制作人先生，男人一定要守时啊
跟着节奏撸，在规定的时间寸止！`;

R.STR['zh'].SP_G_BP = `
（被伊○翼抓住了！）
唔~制作人先生真好色~
现在只准对没有被插入的女孩子寸止！`;

R.STR['zh'].SP_DAY = `
制作人先生辛苦了！
今天也守护了剧场的大家！
请好好休息，为明天作准备
期间请不要泄出能量
而且要做%1次快要泄出能量，最后控制住的练习
然后明天也请一定要来剧场求助被控制的偶像们！`;